[
    {
        "subject_name": "Object Oriented Programming",
        "description":"مادة OOP (Object-Oriented Programming) تعلمنا مفاهيم البرمجة بالكائنات باستخدام لغة Java، مثل الكلاسات، الوراثة، التغليف، والتعدد الشكلي، وتركز على بناء برامج منظمة وقابلة لإعادة الاستخدام.",
        "DS": "230",
        "CS": "230",
        "IT": "232",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #ObjectOrientedProgramming"
        
    },
    {
        "subject_name": "Operating Systems",
       "description": "مادة أنظمة التشغيل تشرح كيف يدير النظام الموارد مثل الذاكرة والمعالج وتشغيل البرامج، وتعرفنا على العمليات والخيوط وأنظمة الملفات.",
        "DS": "351",
        "CS": "351",
        "IT": "241",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #OperatingSystems"
    },
    {
        "subject_name": "Introduction to Database",
       "description": "يركّز هذا المقرر على المفاهيم الأساسية لقواعد البيانات، بما في ذلك تصميم قواعد البيانات، نماذج البيانات، العلاقات، وSQL. يتعلم الطلاب كيفية إنشاء قواعد بيانات فعّالة باستخدام أنظمة إدارة قواعد البيانات مثل MySQL أو Oracle، مع التركيز على تصميم الجداول، التطبيع (Normalization)، واستعلامات SQL المتقدمة. كما يغطي المقرر نموذج الكيان-العلاقة (ER) وأفضل ممارسات إدارة البيانات.",
        "DS": "350",
        "CS": "350",
        "IT": "244",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #IntroductiontoDatabase"
    },
    {
        "subject_name": "Data Structure",
        "description": "يركز هذا المقرر على المفاهيم الأساسية لهياكل البيانات، ويغطي الأنواع المختلفة مثل القوائم (Lists)، المكدسات (Stacks)، الطوابير (Queues)، الأشجار (Trees)، والرسوم البيانية (Graphs). كما يتناول تحليل الكفاءة الزمنية والفراغية للخوارزميات باستخدام Big-O، مع تطبيقات عملية باستخدام لغات برمجة مثل Java.",
        "DS": "240",
        "CS": "240",
        "IT": "245",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DataStructure"
    },
    {
        "subject_name": "Computer Architecture and Organization",
        "description": "يركّز هذا المقرر على البنية الداخلية وتنظيم مكونات الحاسب الآلي. يتناول موضوعات مثل التمثيل الرقمي، تصميم المعالجات، تعليمات التجميع (Assembly Language)، تنظيم الذاكرة، إدخال وإخراج البيانات (Datapaths)، ووحدة التحكم. كما يساعد الطلاب على فهم كيفية تنفيذ البرامج والأوامر داخل المعالج وكيفية تفاعل المكونات المادية لتحقيق الأداء المطلوب.",
        "DS": "243",
        "CS": "241",
        "IT": null,
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #ComputerArchitectureandOrganization"
    },
    {
        "subject_name": "System Analysis and Design",
       "description": "يركز هذا المقرر على تحليل وتصميم نظم المعلومات بهدف تطوير أنظمة فعالة تلبي احتياجات المؤسسات. يتعلم الطلاب كيفية جمع المتطلبات، استخدام النماذج التخطيطية مثل DFD وERD، تصميم واجهات المستخدم، وفهم دورة حياة تطوير النظام (SDLC). كما يغطي المقرر منهجيات التطوير المختلفة مثل Waterfall وAgile، ويوفر مهارات عملية في التوثيق والتحليل المنهجي.",
        "DS": "361",
        "CS": "352",
        "IT": "353",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #SystemAnalysisandDesign"
    },
    {
        "subject_name": "Computer Networks",
        "description": "هذا المقرر يغطي أساسيات شبكات الحاسب، ويشمل المفاهيم المتعلقة بتصميم، تشغيل، وصيانة الشبكات. يشمل المقرر طبقات نموذج OSI وTCP/IP، عناوين IP، البروتوكولات مثل HTTP، TCP، UDP، ARP بالإضافة إلى التبديل، التوجيه، وتقنيات الوصول إلى الوسائط. كما يُركّز على فهم البنية التحتية للشبكات وتطبيقاتها في بيئات الأعمال.",
        "DS": "360",
        "CS": "360",
        "IT": "351",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #ComputerNetworks"
    },
    {
        "subject_name": "Human Computer Interactions",
        "description": "يركز هذا المقرر على التفاعل بين الإنسان والحاسوب، ويهدف إلى تصميم واجهات استخدام فعالة وسهلة للمستخدم. يشمل مواضيع مثل تصميم التفاعل، قابلية الاستخدام، النماذج الذهنية، العوامل البشرية، تقييم الواجهات، وتجربة المستخدم (UX)، مع التركيز على الجوانب النفسية والسلوكية للمستخدمين.",
        "DS": null,
        "CS": "470",
        "IT": "352",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #HumanComputerInteractions"
    },
    {
        "subject_name": "Artificial Intelligence",
       "description": "يتناول هذا المقرر المبادئ الأساسية للذكاء الاصطناعي، ويشمل مواضيع مثل التمثيل المعرفي، البحث في الفضاءات، الخوارزميات الذكية، الأنظمة الخبيرة، الشبكات العصبية، والتعلم الآلي. كما يتعلم الطلاب كيفية تصميم حلول ذكية للمشكلات المعقدة باستخدام تقنيات AI المختلفة، مع التركيز على النمذجة واتخاذ القرار.",
        "DS": "363",
        "CS": "362",
        "IT": null,
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #ArtificialIntelligence"
    },
    {
        "subject_name": "Web Programming / Technologies",
       "description": "يركز هذا المقرر على تقنيات الويب الأساسية، ويُركّز على تطوير صفحات ومواقع الإنترنت باستخدام HTML، CSS، JavaScript وتقنيات السيرفر مثل PHP وMySQL. كما يشمل مبادئ تصميم واجهات المستخدم، التفاعل الديناميكي، وإدارة قواعد البيانات في تطبيقات الويب، مع التركيز على الجانب العملي في بناء تطبيقات ويب متكاملة.",
        "DS": "362",
        "CS": "361",
        "IT": "361",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #WebProgrammingTechnologies"
    },
    {
        "subject_name": "Entrepreneurship and Innovation",
        "description": "يركز هاذا المقرر إلى تعريف الطلاب بمفاهيم ريادة الأعمال والابتكار، ودورهما في تطوير المشاريع وخلق القيمة. يتناول مواضيع مثل خصائص رواد الأعمال، توليد الأفكار، دراسات الجدوى، نماذج الأعمال، تسويق المنتجات المبتكرة، والحلول الإبداعية للمشكلات. كما يركز على كيفية تحويل الأفكار إلى مشاريع واقعية، وتنمية روح المبادرة لدى الطلاب.",
        "DS": null,
        "CS": "364",
        "IT": "364",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #EntrepreneurshipandInnovation"
    },
    {
        "subject_name": "Decision Support Systems",
        "description": "يركز هاذا المقرر مفهوم نظم دعم القرار، والتي تُستخدم لمساعدة المدراء وصناع القرار في تحليل المشكلات المعقدة واتخاذ قرارات أفضل. يشمل المقرر مكونات نظم دعم القرار مثل قواعد البيانات، نماذج التحليل، واجهات المستخدم، وتكامل الذكاء الاصطناعي. كما يستعرض أنواع DSS مثل النظم المعتمدة على النماذج، والنظم المعتمدة على المعرفة، والتقنيات المستخدمة في تنفيذها وتقييم فعاليتها.",
        "DS": "474",
        "CS": null,
        "IT": "475",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DecisionSupportSystems"
    },
    {
        "subject_name": "Project Management",
        "description": "يركّز هذا المقرر على مبادئ وأساليب إدارة المشاريع، خصوصًا في سياق مشاريع تقنية المعلومات. يتعلم الطلاب كيفية تخطيط، تنفيذ، ومراقبة المشاريع، بما في ذلك إدارة الوقت، التكلفة، الجودة، الموارد، والمخاطر. كما يشمل أدوات مثل مخططات Gantt، (تحليل المسار الحرج CPM)، وطرق التقدير والمتابعة.",
        "DS": "353",
        "CS": "480",
        "IT": "362",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #ProjectManagement"
    },
    {
        "subject_name": "Design and Analysis of Algorithms",
       "description": "يركز هذا المقرر على تصميم وتحليل الخوارزميات الفعالة لحل المشكلات الحاسوبية. يشمل موضوعات مثل الخوارزميات التكرارية والتقسيمية، البرمجة الديناميكية، الخوارزميات الجشعة، البحث، الفرز، ومشاكل الرسوم البيانية. كما يتناول تحليل الأداء باستخدام Big-O ومقارنة بين خوارزميات متعددة من حيث الزمن والتعقيد المكاني.",
        "DS": "352",
        "CS": "353",
        "IT": null,
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DesignandAnalysisofAlgorithms"
    },
    {
        "subject_name": "Professional Ethics",
        "description": "يركّز هذا المقرر على المبادئ الأخلاقية والمهنية المتعلقة بمجال الحوسبة وتكنولوجيا المعلومات. يتناول قضايا مثل الخصوصية، الأمن، المسؤولية الاجتماعية، الملكية الفكرية، والسلوك المهني، مع التركيز على كيفية اتخاذ قرارات أخلاقية في المواقف التقنية المختلفة.",
        "DS": "481",
        "CS": "481",
        "IT": "485",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #ProfessionalEthics"
    },
    {
        "subject_name":"Advanced Data Science Programming",
        "description":"مادة برمجة بايثون تتكلم عن مواضيع زي اساسيات بايثون الويب سكرابنق مكاتب الداتا ساينس الخ المادة ممتعة جدا بس تحتاج تطبيق مستمر",
        "DS":"242",
        "CS":null,
        "IT":null,
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DesignandAnalysisofAlgorithms"
    },
    {
        "subject_name":"Discrete Mathematics",
        "description":" يركز هاذا المقرر على المفاهيم الاساسية للرياضيات المتقطعة, والتي تستخدم لفهم وحل المشكلات المنطقية والحسابية في علوم الحاسب. تشمل مواضيع  المقرر:  المنطق الرقمي , الجمل المركبة , الجداول الصدقية(تروث تيبل) الاثباتات الرياضية , الكميات , قوانين دي مورغان .  يهدف المقرر إلى تعزيز الفكير المنطقي والتحليل الرياضي ويمثل اساسا مهمآ لفهم الخوارزميات",
        "MATH":"150",
         "telegram_search_instruction": "Search on Telegram channel @computingg using: #DesignandAnalysisofAlgorithms" 
    },
    {
        "subject_name" :"General Physics I",
        "description":"يركز هاذا المقرر على المفاهيم الاساسية في الفيزياء, ويغطي مواضيع مثل الحركة , السرعة , التسارع , قوانين نيوتين , الطاقة , الشغل , القدرة , والزخم. كما يتناول المبادئ المرتبطة بالدوران والجاذبية . يهدف المقرر إالى تطوير الفهم الفيزيائي لظواهر الحياة اليومية, وتنمية المهارات التحليلية من خلال المسائل الكمية والتجريبية",
        "SCI" : "101",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DesignandAnalysisofAlgorithms" 

    },
    {
        "subject_name":"Linear Algebra",
        "MATH":"251",
        "description":"يركز المقرر على اساسيات المصفوفات والمتجهات, وطرق العمليات عليها مثل الجمع والضرب, وحل الانظمة الخطية .  المحددات، الفضاءات الاتجاهية، المتجهات، الاستقلال الخطي، التحويلات الخطية، والقيم الذاتية والمتجهات الذاتية. وركزت المادة على التطبيقات الرياضية التي يحتاجها الطالب في مجالات مثل الرسوميات والذكاء الاصطناعي",
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DesignandAnalysisofAlgorithms" 
    
    },
    {
        "subject_name":"Principles of Programming Languages",
        "description":"يركز المقرر على دراسة المبادئ الاساسية التي تقوم عليها لغات البرمجة, ويهدف إالى تحليل وفهم المفاهيم المشتركة بين محتلف اللغات البرمجية. تشمل مواضيع مثل الانماط النحوية(syntax) والدلالية (semnatics), انواع البيانات , النطاق (scop),البرمجة الاجرائية والوظيفية والمنطقية , وتقييم الاداء والمقارنة بين اللغات .     يهدف المقرر إالى تمكين الطلاب من اختيار وفهم لغات البرمجة المختلفة بوعي",
        "CS":"363",
        "DS":null,
        "IT" : null,
        "telegram_search_instruction": "Search on Telegram channel @computingg using: #DesignandAnalysisofAlgorithms"

    }

]